# Задача 3: Периметр и площадь прямоугольника
# Напишите программу, которая запрашивает у пользователя длину и ширину прямоугольника и выводит его периметр и площадь.
# Пример:
# Ввод: 4, 7
# Вывод: Периметр: 22, Площадь: 28
t = input().split(', ')
p= 2 * (int(s[0])+int(s[1]))
s = (int(s[0])) * (int(s[1]))
print(f'Периметр: {p}, Площадь: {s}')